[
  {
    "author": "[deleted]",
    "commentlist": [
      {
        "author": "eigenheckler",
        "avatar": "/avatar/communityIcon_jxbrkfsppv481.png",
        "commentES": 2,
        "commentIS": 2,
        "commentId": "cfsccea",
        "commentsublist": [],
        "createTime": "2014-03-02T17:22:32",
        "parentId": "cfrv64o",
        "postId": "1za7v2",
        "text": "Look up \"mirror neurons.\"\n\nThis is likely rooted in the same neurological architecture that make us wince when we see physically painful things happening to other people."
      },
      {
        "author": "mizzlebizzle",
        "avatar": "/avatar/communityIcon_k8nk4v2gnqrc1.png",
        "commentES": 2,
        "commentIS": 3,
        "commentId": "cfrzibd",
        "commentsublist": [],
        "createTime": "2014-03-02T06:13:40",
        "parentId": "cfrv64o",
        "postId": "1za7v2",
        "text": "It's because you're imaging and visualizing yourself in that scenario.  And you're fearing what you have felt in those situations in the past - anxiety and panic.  \n\nBut... this is actually a great technique called exposure therapy.  For instance, people afraid of bridges might slowly start to expose themselves from a distance - looking at pictures and videos of a bridge, etc.  You slowly \"put yourself\" in that situation you fear and learn to recondition your brain to realize that it is not something to fear.\n\nIt's okay and completely normal.  "
      },
      {
        "author": "CDB979",
        "avatar": "/avatar/communityIcon_wpxjh8fuvcw51.png",
        "commentES": 3,
        "commentIS": 2,
        "commentId": "cfrweq1",
        "commentsublist": [],
        "createTime": "2014-03-02T03:57:11",
        "parentId": "1za7v2",
        "postId": "1za7v2",
        "text": "Yeah. I have felt Afar Anxiety before. It kinda reflects on what situations I tend to favor and not favor. For example my mind would be clear as a bell in a situation like a shootout but something that puts emphasis on social interaction like a party or night club I tend to get antsy watching."
      },
      {
        "author": "[deleted]",
        "avatar": "/avatar/voAwqXNBDO4JwIODmO4HXXkUJbnVo_mL_bENHeagDNo.png",
        "commentES": 2,
        "commentIS": 2,
        "commentId": "cfrv64o",
        "commentsublist": [],
        "createTime": "2014-03-02T03:03:45",
        "parentId": "1za7v2",
        "postId": "1za7v2",
        "text": "And if it does what contributes to it? I'm trying to figure out if it is actual anxiety, or just shame and jealousy because many times the people you are watching are about your age"
      }
    ],
    "createTime": "2014-03-02T03:02:51",
    "postES": 1,
    "postIS": 3,
    "postId": "1za7v2",
    "text": "Like if you're watching a pool party from your college apartment, a nightclub scene in a movie, or a big group of people in a youtube video? Like I know I'm not there, but since my eyes are looking at it, it feels like a slight part of me is.",
    "title": "Does watching a situation where you're anxiety would kick in big time from AFAR still give off bad vibes?"
  }
]