[
    {
        "author": "[deleted]",
        "commentlist": [
            {
                "author": "eigenheckler",
                "commentES": 2,
                "commentIS": 2,
                "commentId": "cfsccea",
                "commentsublist": [],
                "createTime": "2014-03-02T17:22:32",
                "parentId": "cfrv64o",
                "postId": "1za7v2",
                "text": "Look up \"mirror neurons.\"\n\nThis is likely rooted in the same neurological architecture that make us wince when we see physically painful things happening to other people."
            },
            {
                "author": "mizzlebizzle",
                "commentES": 2,
                "commentIS": 3,
                "commentId": "cfrzibd",
                "commentsublist": [],
                "createTime": "2014-03-02T06:13:40",
                "parentId": "cfrv64o",
                "postId": "1za7v2",
                "text": "It's because you're imaging and visualizing yourself in that scenario.  And you're fearing what you have felt in those situations in the past - anxiety and panic.  \n\nBut... this is actually a great technique called exposure therapy.  For instance, people afraid of bridges might slowly start to expose themselves from a distance - looking at pictures and videos of a bridge, etc.  You slowly \"put yourself\" in that situation you fear and learn to recondition your brain to realize that it is not something to fear.\n\nIt's okay and completely normal.  "
            },
            {
                "author": "CDB979",
                "commentES": 3,
                "commentIS": 2,
                "commentId": "cfrweq1",
                "commentsublist": [],
                "createTime": "2014-03-02T03:57:11",
                "parentId": "1za7v2",
                "postId": "1za7v2",
                "text": "Yeah. I have felt Afar Anxiety before. It kinda reflects on what situations I tend to favor and not favor. For example my mind would be clear as a bell in a situation like a shootout but something that puts emphasis on social interaction like a party or night club I tend to get antsy watching."
            },
            {
                "author": "[deleted]",
                "commentES": 2,
                "commentIS": 2,
                "commentId": "cfrv64o",
                "commentsublist": [],
                "createTime": "2014-03-02T03:03:45",
                "parentId": "1za7v2",
                "postId": "1za7v2",
                "text": "And if it does what contributes to it? I'm trying to figure out if it is actual anxiety, or just shame and jealousy because many times the people you are watching are about your age"
            }
        ],
        "createTime": "2014-03-02T03:02:51",
        "postES": 1,
        "postIS": 3,
        "postId": "1za7v2",
        "text": "Like if you're watching a pool party from your college apartment, a nightclub scene in a movie, or a big group of people in a youtube video? Like I know I'm not there, but since my eyes are looking at it, it feels like a slight part of me is.",
        "title": "Does watching a situation where you're anxiety would kick in big time from AFAR still give off bad vibes?"
    },
    {
        "author": "Anxiouself",
        "commentlist": [
            {
                "author": "give_me_pockets",
                "commentES": 3,
                "commentIS": 3,
                "commentId": "cfrxho5",
                "commentsublist": [],
                "createTime": "2014-03-02T04:45:07",
                "parentId": "1za1p4",
                "postId": "1za1p4",
                "text": "Would you feel up for looking into your schools counseling center? Usually you can get a certain amount of free sessions. I know it has a really negative stigma, but your mental health is more important than what other people think of you. I highly recommend it. "
            }
        ],
        "createTime": "2014-03-02T01:55:03",
        "postES": 3,
        "postIS": 3,
        "postId": "1za1p4",
        "text": "To give you some background, I'm a Junior in college and this semester I have 12 credits, a part time research internship/job, and I'm self studying for the MCAT in April. I've always been anxious about doing well in school but I feel like my anxiety has become a problem in the past year. All of last spring I felt like my heart was jumping out of my chest, like I had too much coffee and looking back at it I realize now that I was depressed too, even though I didn't really realize it at the time.\n\n Things have felt like they are better this semester but there are days that I don't want to get out of bed because I feel so tense and anxious. I had to cancel on someone I research with yesterday because I was feeling so badly in general. I barely have time this semester for myself. If I'm not studying, I'm at my internship and vice versa. I want to get all these things done, and I know I could but I feel like the anxious part of me drags me down and tells me I can't do this, I should stop trying, and I should just give up on everything. I have recurring negative thoughts that I can't turn off.\n\n\nAny advice? Especially on keeping negative thoughts at bay.",
        "title": "My anxiety is becoming overwhelming... any thoughts?"
    },
    {
        "author": "in0vis",
        "commentlist": [
            {
                "author": "in0vis",
                "commentES": 1,
                "commentIS": 2,
                "commentId": "cfrvsd9",
                "commentsublist": [],
                "createTime": "2014-03-02T03:30:24",
                "parentId": "cfrsqi7",
                "postId": "1z9vz5",
                "text": "I should've said masturbation addiction + porn. "
            },
            {
                "author": "WideEyedPup",
                "commentES": 3,
                "commentIS": 3,
                "commentId": "cfrtdga",
                "commentsublist": [],
                "createTime": "2014-03-02T01:46:07",
                "parentId": "1z9vz5",
                "postId": "1z9vz5",
                "text": "It's probably not masturbation that is a cause of anxiety -- it's a perfectly healthy thing you can fit into your life. One thing that exacerbates anxiety, though, is forming habits, if they are habits you get hung up about. So it's best as far as I can tell not to get hung up about wanking, nor to overindulge. Allow yourself to do it, but not to spend all day doing it, and let it become just one part of a routine where you're also exercising, eating healthily and concentrating on work/study/whatever it is you do. There's no point adding to your anxiousness by creating a guilt complex about a perfectly normal human function! (*usual I am not a doctor proviso*)"
            },
            {
                "author": "mizzlebizzle",
                "commentES": 1,
                "commentIS": 1,
                "commentId": "cfrsqi7",
                "commentsublist": [],
                "createTime": "2014-03-02T01:17:25",
                "parentId": "1z9vz5",
                "postId": "1z9vz5",
                "text": "I'm confused - how can masturbation be a cause of anxiety and ocd?"
            }
        ],
        "createTime": "2014-03-02T00:49:36",
        "postES": 2,
        "postIS": 3,
        "postId": "1z9vz5",
        "text": "I figured out that mastrbation might be the cause of anxiety ocd etc.\nI started doing that and felt really good. Yesterday I couldn't resist the urge, but I felt okay, because I got to 11 days.\n\nToday I woke up with anxiety, stress, awful thoughts and I can't sit in one place :(\n\nI got dd/ocd and anixety in summer 2013, but I was fighting and it was fading, but today :( I don't know why.  I had that ocd problems when I try to sleep, because I need to wash several times, because i said to myself that I will wake up in coffin, crematory... Yesterday I said NO and I felt asleep without doing OCD stuff.\n\nCan you help me? I just want it to be as it was yesterday :/",
        "title": "It was almost over, but today I started again (but less :)"
    },
    {
        "author": "MrParker12",
        "commentlist": [
            {
                "author": "revmyk",
                "commentES": 2,
                "commentIS": 2,
                "commentId": "cfs3xte",
                "commentsublist": [],
                "createTime": "2014-03-02T09:34:06",
                "parentId": "1z9dwx",
                "postId": "1z9dwx",
                "text": "yes I was prescribed xanax for a while, then I was prescribed cannabis. cannabis works great. xanax is dangerous long term. cannabis is good for those acute situations like when I have to grocery shop and I panic before going into the store. I can take a few hits on the vape pen.  "
            },
            {
                "author": "The_Kick-Ass_Duke",
                "commentES": 2,
                "commentIS": 2,
                "commentId": "cfrp0wm",
                "commentsublist": [],
                "createTime": "2014-03-01T21:39:39",
                "parentId": "1z9dwx",
                "postId": "1z9dwx",
                "text": "I get these fairly frequently. I did used to get them for hours at a time, but I've gotten more of a handle on them as time has gone by. So now when I get one, I can usually get them under control fairly quickly, and they only last for 10 seconds or so. I hope that as I continue to get more control of my nerves that they will eventually go away completely."
            }
        ],
        "createTime": "2014-03-01T20:19:31",
        "postES": 1,
        "postIS": 3,
        "postId": "1z9dwx",
        "text": "I frequently read people on here complaining of panic attacks lasting hours or days. My panic attacks tend to be really short but often frequent. So they might involve fear, sweating and shaking but only last  1-10 mins and happen throughout the day. Can anyone relate to this?\n\nthanks",
        "title": "Anyone get short sharp panic attacks?"
    },
    {
        "author": "4ofclubs",
        "commentlist": [
            {
                "author": "FlaviusMaximus",
                "commentES": 3,
                "commentIS": 3,
                "commentId": "cfsj4ue",
                "commentsublist": [],
                "createTime": "2014-03-03T01:43:00",
                "parentId": "cfrnhuh",
                "postId": "1z97fv",
                "text": "I get this all the time, although I rarely freak out about it these days. \nThere are several possible causes. The main ones seem to be poor breathing patterns, which increases the concentration of CO2 in your blood causing muscle spasms; acid reflux, which could be due to poor eating, food intolerance or stress itself; or muscle pain from tensing up. For what it's worth I seem to have a combination of all 3. \n\nIt's never nice, but once you rationalise it and come to realise that you wouldn't be here if it was a heart problem every time, it will get better. I tend to find I have 'relapses' every few months which ironically remind me that it can't be a serious problem, or I wouldn't be here to experience it. \n\nI hope that helps - feel free to PM me if you'd like to discuss things further. "
            }
        ],
        "createTime": "2014-03-01T17:57:39",
        "postES": 3,
        "postIS": 3,
        "postId": "1z97fv",
        "text": "I seriously felt myself dying today.\n\nI started feeling off and a little dizzy all day, chalking it up to my chest pain that I've had for the past few days (which I was trying not to convince myself was something bad.)\n\nThen it hit me, and I was like \"I'm having a heart attack.\" I did my deep breaths to calm down, and it went away, and I was sitting there, trying not to think about it. I decided to take a bath, and then it happened again. Deep breaths. Went away. Then all of a sudden it hit me right in the chest like a fire dagger pulling it out.\n\nI was dying.\n\nI've never felt this before. My heart was being pulled out of me through my chest and I was passing out. I called 9-1-1 but I couldn't figure out how to explain it to them so they got mad at me over the phone for wasting their time and that made it worse.\n\nI live alone so I decided to drive to the emergency room. \n\nI explained my situation, and they made me wait an hour and a half in the waiting room, while I was sitting there thinking I was dying. The initial pain had gone away, but I was freaking out.\n\nThe doctor did heart tests and everything, and said I'm fine. 100%.\n\nWhat the hell was it?\n\nHe assumes an anxiety attack. I was over tired and over caffeinated. I was freaking out about my chest pain and it got that bad.\n\nI had no idea Anxiety Attacks could be this bad. \n\nCan anyone relate?\n\ntldr: Anxiety attacks = Heart attacks!!!",
        "title": "I was certain I was dying"
    },
    {
        "author": "[deleted]",
        "commentlist": [
            {
                "author": "lechino3000",
                "commentES": 2,
                "commentIS": 3,
                "commentId": "cfrwnhx",
                "commentsublist": [],
                "createTime": "2014-03-02T04:08:04",
                "parentId": "1z971a",
                "postId": "1z971a",
                "text": "Hang in there. I know the feeling of handling school work, grades and competing against others just to get a chance to succeed. It's so hard and I also second guess myself. Anyway, have you thought of attending group counseling meetings at school? Go to your student counseling center for emotional support.  And like I said hang in there and take it one mother fucker step at a time."
            }
        ],
        "createTime": "2014-03-01T17:48:42",
        "postES": 1,
        "postIS": 3,
        "postId": "1z971a",
        "text": "I've been under an enormous amount of stress lately, which has been awful for my anxiety. As background, I'm currently a student, and am planning to transfer into a nursing program next year. I'm in the very stressful process of applying, and have already submitted a couple applications. At the same time, I'm also trying to find a part time job that I'm qualified for and works with my school schedule. I live at home with my parents and my sister who is also going to enter college directly from high school. So far she has been accepted in 100% of the schools she applied to, whereas for me, I'm still playing the waiting  game because my applications are due later. I've tried talking to friends and family about it, but it's difficult for them to understand. My friends try to be supportive by saying things like \"it'll be okay\" or \"you're over-worrying yourself\" but I can tell they get tired of seeing my worked up over small-ish things. My family, on the other hand, does not really \"believe\" in anxiety. I hear things like \"just relax\" or \"stop being so nervous all the time.\" If only it were that easy.\n\nLately, I've noticed that when I'm trying to work on homework, job applications, or school applications/personal statements, my mind wanders and I start doubting myself, and getting really panicky. All these thoughts creep into my mind (\"What if I don't get in anywhere?\" \"My parents will be so ashamed of me, and call me a loser.\" Or, I start thinking that I did my applications all wrong, or that I'm forgetting something major) I end up having to distract myself with other things because I start panicking so much. Of course, this has done nothing for my productivity, and I end up taking way too long to finish anything because I cannot concentrate on what needs to be done. I wish there was some sort of switch for my brain to just be able to focus on one thing. \n\nI guess what I'm writing here for is advice on how to manage my anxiety during times of unavoidable stress, and also any concentration/study tips for when you are very anxious. Also, how do you deal with anxiety when waiting for something (like college admissions? I guess this is anticipatory anxiety.) Thank you.",
        "title": "Anxiety and trouble concentrating on my tasks. [Help]"
    },
    {
        "author": "DethBreth",
        "commentlist": [
            {
                "author": "mizzlebizzle",
                "commentES": 2,
                "commentIS": 2,
                "commentId": "cfs5511",
                "commentsublist": [],
                "createTime": "2014-03-02T10:30:02",
                "parentId": "1z92e2",
                "postId": "1z92e2",
                "text": "Because this is a sub filled with people who can relate and understand.  As much help as others can be, unless you've lived this you will never truly understand."
            },
            {
                "author": "[deleted]",
                "commentES": 2,
                "commentIS": 1,
                "commentId": "cfrme1k",
                "commentsublist": [],
                "createTime": "2014-03-01T16:47:06",
                "parentId": "1z92e2",
                "postId": "1z92e2",
                "text": "My first port of call used to be my best friend. She's been there for me for so long. I came here for comfort tonight because I cant bring myself to bother her with my texts. Its comforting being here."
            }
        ],
        "createTime": "2014-03-01T16:26:40",
        "postES": 1,
        "postIS": 3,
        "postId": "1z92e2",
        "text": "Racing mind.\nStaggered breathing\n\nIt's in your head \nIs this fleeting?\n\nMy mind is strong and knows the war",
        "title": "[First post] why do I seek refuge here, before all others?"
    }
]